/*
    Команда SHOW может использоваться для вывода
    информации о столбцах таблицы:

    SHOW COLUMNS FROM table name ;
        Команда выводит описания всех столбцов таблицы
        с типами данных, а также другими сведениями, относя­
        щимся к конкретным столбцам.

    SHOW CREATE DATABASE databasename;
        По аналогии с командой SHOW CREATE <таблица>,
        эта команда выводит код команды создания базы данных.

    SHOW INDEX FROM table name ;
        Команда выводит информацию об индексируемых

    SHOW WARNINGS;
        Если на консоли выводится сообщение о том, что
        выполнение команды SQL привело к выдаче предупре­
        ждений, то для просмотра предупреждений используется
        команда SHOW WARNINGS.

    Команда SHOW CREATE_TABLE возвращает команду CREATE TABLE,
    которая была использована для создания таблицы (до занесения
    в таблицу первых данных). Попробуйте ввести следующую команду:
 */