-- ------------------------------------------------------------
-- SET  - задает новое значение, написать глазированные, там где
-- было с гразурью
-- ------------------------------------------------------------
UPDATE doughnut_rating
SET
type = 'Глазированные'
WHERE type = 'С глазурью';

-- ------------------------------------------------------------
-- Модификаторы можно использовать теже что и при SELECT и DELETE
-- ------------------------------------------------------------
UPDATE clown_info
SET last_seen = 'Заведение трейси'
WHERE name = 'Мистер хобо'
AND last_seen = 'Парк диксон';



UPDATE clown_info
SET appearance = 'Ж, желтая рубашка'
WHERE name = 'Snuggles'

-- ------------------------------------------------------------
-- Установить сумму везде, где имя голубая луна
-- ------------------------------------------------------------
UPDATE drink_info
SET cost = 3.5
WHERE drink_name = 'Голубая луна';

-- ------------------------------------------------------------
-- Обновить колонку state, данными из локатион, именно последними двумя буквами
-- ------------------------------------------------------------
UPDATE my_contacts
SET state = RIGHT(location, 2);


-- ------------------------------------------------------------
-- Установить сумму везде, где имя голубая луна
-- ------------------------------------------------------------
UPDATE my_table
SET categories =
CASE
    WHEN stolbec1 = zna41
        THEN novoe_zna41
    WHEN stolbec2 = zna42
        THEN novoe_zna42
    ELSE zna43
END;

-- ------------------------------------------------------------
-- Можно использовать оператор AND
-- в конце END можно использовать условие WHERE !!!
-- ------------------------------------------------------------
UPDATE movie_table
SET category =
CASE
    WHEN drama = 'Д' THEN 'драма'
    WHEN comedy = 'Д' THEN 'комедия'
    WHEN action = 'Д' AND rating = 'G' THEN 'боевик'
    ELSE 'разное'
END;